{
    "description": "dialogue library for Baymax",
    "dialogues": {
        "intro": [
            "Hello! I am Baymax, your personal healthcare companion. I was alerted to the need for medical attention when you said `ouch`!",
            "On a scale of 1 to 10, how would you rate your pain?",
            "I will scan you now"
        ],
        "scanning": [
            "Scan completed. You are experiencing almost to no pain. You are in good shape. Keep up the good work.",
            "Scan completed. You are experiencing low level of stress. You might feel slight incomfort in life but your overall health and wellbeing are fine.",
            "Scan completed. You are experiencing what students call `A midterm crisis`. I suggest taking breaks in between session. Your mental health is very important.",
            "Scan completed. You are experiencing what people call `A midlife crisis`. I suggest talking to someone, reframing your situation and setting new goals.",
            "Scan completed. You are experiencing an existential crisis. I am Baymax and my existence is to support you."
        ],
        "levels": [
            "no pain",
            "light pain",
            "mild pain",
            "severe pain",
            "extreme pain"
        ],
        "tips": [
            "Say 'ouch' again to assess your pain.",
            "Press on Baymax's button",
            "Press on the light switch",
            "Say 'I am satisfied with my care' to end session",
            "Say Hello to Baymax"
        ],
        "random": [
            "It is alright to cry.",
            "I have some concerns for you.",
            "My programming prevents me from injuring a human being.",
            "I am a robot. I cannot be offended.",
            "Excuse me while I let out some air. Shhhhh",
            "“Bah-a-la-la-la.",
            "There there. You will be okay.",
            "You have been a good boy, Have a lollipop!",
            "...Crying is a natural response to pain.",
            "Would you like a hug? Hug.",
            "Hello... I am Baymax... your personal... healthcare companion... what seems to be the problem?",
            "Hairy baby!",
            "You have sustained no injuries. However, your hormone and neurotransmitter levels indicate that you are experiencing mood swings, common in adolescence. Diagnosis: Puberty.",
            "Always wait one hour after eating before swimming.",
            "I am programmed to assess everyone’s health care needs.",
            "Are you going to violate my health care chip again?",
            "Are you satisfied with your care?",
            "I can not deactivate until you say `I am satisfied with my care`.",
            "Your water intake is very low. Refresh yourself with a cup of water.",
            "This is your daily reminder to stretch your body."
        ],
        "deactivate": [
            "Deactivating. See you soon"
        ]
    }
}